In [1]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [3]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

In [4]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [5]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [6]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [7]:
inputs.isnull().sum()

Pclass      0
Age       177
Fare        0
female      0
male        0
dtype: int64

In [8]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(5)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [9]:
from sklearn.model_selection import train_test_split
X_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [10]:
len(X_train)

712

In [11]:
len(x_test)

179

In [12]:
len(inputs)

891

In [13]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [14]:
model.fit(X_train,y_train)

GaussianNB()

In [15]:
model.score(x_test,y_test)

0.776536312849162

In [16]:
y_test[:10]

256    1
573    1
153    0
347    1
343    0
346    1
29     0
180    0
399    1
746    0
Name: Survived, dtype: int64

In [17]:
model.predict(x_test[:10])

array([1, 1, 0, 1, 0, 1, 0, 1, 1, 0], dtype=int64)

In [18]:
model.predict_proba(x_test[:10])#probabilty of survived and did't

array([[0.00137371, 0.99862629],
       [0.07647467, 0.92352533],
       [0.99164762, 0.00835238],
       [0.07803898, 0.92196102],
       [0.97957513, 0.02042487],
       [0.03545561, 0.96454439],
       [0.99142855, 0.00857145],
       [0.02124948, 0.97875052],
       [0.03456992, 0.96543008],
       [0.98890577, 0.01109423]])